/*1.希望している仕事*/
プログラマーを志望しています。
/*2.仕事を選んだ理由*/
//技術やスキルを磨くことでやれることの幅が広がる 
技術やスキルを磨くことで、実装可能なコンテンツの幅を増やすことができると考えています。
それにより業務をよりスムーズに進めることはもちろん、顧客の要望に対しても多くの提案を引き出せると考えています。
これは仕事への充実感や成長の実感に直結してくると思っています。 
またこの繰り返しにより、
スキルアップを続けることでマネジメントなどエンジニアとしてのキャリアアップにも繋がるのではないかと考えています。
そのために、実務を経て学ぶことができるプログラマーを志望しています。
/*3.長所と短所*/
1. 向上心と自己フィードバック力
　私は、常に自分の成長を意識し、プログラムの改善や学びに対して積極的に取り組んでいます。
改善の意識を持って柔軟に手法や考え方を試行し、状況に応じた対応を行うことで、
理想に近い形でソースコードを組むことに役立てています。
具体的な例としては、2，3点手法を考案したうえでChatGPTさんにどの手法がいいかを訊ねると、
「Aの手法は、こういう時に有用で、Bの手法はこの時に有用です。」のような返答が返ってくるので、
よりニーズにあったものを選択するようなことを行っています。

2. 探究心と新しい分野への挑戦
　創作活動や技術分野への探究心があり、積極的に新しい分野にも挑戦しています。
例えば、最近ではプログラミングの学習や、AviutlやMMDを自ら調べて使い方を学び、着実に成果を出しています。
これらの活動はプログラミングだけでなく、
他の分野でも挑戦し続ける姿勢がエンジニアとしての幅広い視点を養うものと考えています。

3. チームワークとサポート精神
　柔らかく親しみやすいコミュニケーションを心掛け、チームで協力する姿勢を大切にしています。
普段から表現や語調に気を配り、相手が話しかけやすい雰囲気を作るよう心掛けています。
よくあることとしては、残って作業している人間に「今どんなことしているの？」というように話しかけて、
詰まっているようであれば自分なりの解決案を提示してみる、新しいことをやっているのであれば、
その説明を聞き出してみる、というようなことをしています。

1.忍耐力が必要な作業で疲れてしまうこと
短所：集中力を維持することが難しく、特に長時間の単調な作業ではペースが落ちることがあります。
改善：こうした状況では休憩やリフレッシュを意識的に取り入れ、効率を保つよう工夫しています。

慎重すぎること
2.物事を進める際に慎重になりすぎて、行動が遅くなることがあります。
改善：しかし、最近は小さなタスクに分けて進めることでスピード感を持つよう心掛けています。
結果として、ミスを減らしつつも効率よく作業を進められるようになりました。

3.過度に簡略化しがち
短所:
理解を簡単にするために、自分の解釈を基に言語化し、
ニュアンスを重視してコミュニケーションを取る傾向があります。
これにより、時には誤解を招くことがあります。
改善:
この傾向を意識して、情報を発信する前にしっかり調べてからやり取りを行うよう心掛けています。
また、重要な情報は再度確認するなどして、正確に伝わるように注意を払っています。

/*4.今までの経歴*/
今年の４月に退職後５月に職業訓練の面接を受け、６月から実際に訓練を開始しました。
具体的な内容としましては、Javaの基礎を１か月ほど掛けてしっかりと学んだ後、
HTML,JS,CSS,JSP,Servlet,Python,Unityでの開発などを半年の間学習いたしました。
/*5.退職理由*/
数年前からプログラマーの訓練の存在は知っていたのですが、当時は収入の安定や貯蓄がなく断念しておりました。
ただ、その際に雇用保険で収入を得ながら訓練を受ける方法があることを知り、
ひとまず雇用保険がある正社員で働くことを決意し、1年経過したため退職いたしました。